#include <stdio.h>
#include <stdlib.h>
#include <conio.h>
#include <windows.h>

int main(void)
{
again:;
    int b, y = 6, x = 4; //y可以从第一个数起，x数完后要减一
    char sb; 
    char a[11][16]={"    ###       ",//1 
                    "    #*#       ",//2
                    "    # #       ",//3 
                    " ####O######  ",//4
                    " #* OS O  *#  ",//5
                    " #####O#####  ",//6 
                    "     # #      ",//7 
                    "     #*#      ",//8 
                    "     ###      ",//9 
                    " 按下B键可退出 ",//10 
                    " 按下R键可重开 ",//11
                    };

    while(1) 
    {
        for(b=0;b<=10;b++)//打印迷宫 
        { 
            puts(a[b]);
        }

        sb=getch();//从用户处读入一个指令
        if(sb=='s')//小人向下
        {
            //不推箱子时实现向下
            if(a[x+1][y]!='#' && a[x+1][y]!='O' && a[x+1][y]!='@')
            { 
                a[x][y]=' '; 
                x++; 
                a[x][y]='S'; 
                goto node; //跳转到胜利条件判定处 
            }
            //推箱子时执行实现向下
            if(a[x+2][y]!='#' && a[x+1][y]=='O' && a[x+2][y]!='O' || (a[x+1][y]=='@' && a[x+2][y]!='#'))
            { 
                a[x][y]=' '; 
                x += 2;
                a[x][y]='O'; 
                x--; 
                a[x][y]='S'; 
            } 
        }

        if(sb=='w')//小人向上 
        {
            //不推箱子的时候实现向上 
            if(a[x-1][y]!='#' && a[x-1][y]!='O' && a[x-1][y]!='@') 
            { 
                a[x][y]=' '; 
                x--; 
                a[x][y]='S'; 
                goto node; //跳转到胜利条件判定处
            }
            //推箱子的时候实现向上
            if(a[x-2][y]!='#' && a[x-1][y]=='O' && a[x-2][y]!='O' || (a[x-1][y]=='@' && a[x-2][y]!='#')) 
            { 
                a[x][y]=' '; 
                x -= 2;
                a[x][y]='O'; 
                x++; 
                a[x][y]='S'; 
            } 
        }

        if(sb=='d')//小人向右 
        {
            //不推箱子实现向右
            if(a[x][y+1]!='#' && a[x][y+1]!='O' && a[x][y+1]!='@') 
            { 
                a[x][y]=' '; 
                y ++ ; 
                a[x][y]='S'; 
                goto node; //跳转到胜利条件判定处
            }
            //推箱子时实现向右
            if(a[x][y+2]!='#' && a[x][y+1]=='O' && a[x][y+2]!='O' || (a[x][y+1]=='@' && a[x][y+2]!='#')) 
            {
                a[x][y]=' '; 
                y+=2; 
                a[x][y]='O'; 
                y--; 
                a[x][y]='S'; 
            } 
        }

        if(sb=='a')//小人向左 
        { 
            if(a[x][y-1]!='#' && a[x][y-1]!='O' && a[x][y-1]!='@') 
            { 
                a[x][y]=' '; 
                y--; 
                a[x][y]='S'; 
                goto node; //跳转到胜利条件判定处
            } 
            if(a[x][y-2]!='#' && a[x][y-1]=='O' && a[x][y-2]!='O' || (a[x][y-1]=='@' && a[x][y-2]!='#')) 
            { 
                a[x][y]=' '; 
                y-=2;
                a[x][y]='O'; 
                y++; 
                a[x][y]='S'; 
            } 
        }

        node:;//胜利条件判定

        if(a[1][5]=='@' && a[4][2]=='@' && a[4][10]=='@' && a[7][6]=='@')//胜利条件判定
            break;

        {//判断箱子是否到位，以下四个坐标如果检测到箱子，则会变成@
            if(a[1][5]=='O')//让箱子到指定位置是变成@
                a[1][5]='@'; 
            if(a[4][2]=='O') 
                a[4][2]='@'; 
            if(a[4][10]=='O') 
                a[4][10]='@'; 
            if(a[7][6]=='O') 
                a[7][6]='@';
        }

        if(a[1][5]!='@' && a[1][5]!='S')//让箱子指定位置时离开时恢复*号
            a[1][5]='*'; 
        if(a[4][2]!='@' && a[4][2]!='S') 
            a[4][2]='*'; 
        if(a[4][10]!='@' && a[4][10]!='S') 
            a[4][10]='*';
        if(a[7][6]!='@' && a[7][6]!='S') 
            a[7][6]='*';

        //判断用户是否需要结束或者重开
        if(sb=='b')
            goto thi;
        if(sb=='r') 
            goto again;

        system("cls");

    } 
    system("cls");
    printf("====YOU WIN====");


    if(0>1)//退出界面 
    { 
        thi:; 
        system("cls"); 
        printf("\n 已退出\n"); 
    } 
    Sleep(750); 
    return 0;
}