#include <stdio.h>
#include <windows.h>
#include <conio.h>

int main(void)
{
    int x1, y1;//自机初始位置
    int x2[4], y2[4];//箱子初始位置
    int x3, y3;//终点位置

    char map1[11][30]={"    ###       ",//1 
                       "    #*#       ",//2
                       "    # #       ",//3
                       " ####O######  ",//4
                       " #*  OS O *#  ",//5
                       " #####O#####  ",//6 
                       "     # #      ",//7 
                       "     #*#      ",//8 
                       "     ###      ",//9 
                       " 按下B键可退出      ",//10 
                       " 按下R键可重开      ",//11
                      };

    x1 = 6, y1 = 4;

    x2[1] = 5, y2[1] = 3;

    x3=....
//map 2
    char map2[20][20] = {"       ",
                         "       ",
                         "       ",
                        };

}